Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings)
Compares two color settings objects.
other:
Color settings object to compare to.
Returns:
True if objects are equal, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.Colors
Get number of colors, including min, max and intermediate.
Returns:
Number of colors, including min, max and intermediate.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.SetIntermediateColors(System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry})
Set intermediate color entries (other than the minimum and maximum settings).
map:
Array of intermediate color entries.
Throws Autodesk.Revit.Exceptions.ArgumentException:
intermediate color entries with specific values are not ordered by value (min to max) or too many intermediate colors (>100).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.AreIntermediateColorsValid(System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry})
Verify intermediate color entries
map:
Array of intermediate color entries.
Returns:
True if intermediate colors are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.GetIntermediateColors
Get intermediate color entries (other than the minimum and maximum settings).
Returns:
Array of intermediate color entries.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.ColorSettingsType
Stores type of color settings
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.MinColor
Color assigned to the minimum value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.MaxColor
Color assigned to the maximum value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.#ctor
Constructs a default instance of color settings.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings)
Constructs a new copy of the input AnalysisDisplayColorSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings
Contains color settings for analysis display style element.
Since:
2011